Repository: Part-DB/Part-DB-server
Catalog: translations/security.*.xlf
Languages: de

source: An authentication exception occurred.
de: Es ist ein Fehler bei der Authentifikation aufgetreten.

source: Authentication credentials could not be found.
de: Es konnten keine Zugangsdaten gefunden werden.

source: Authentication request could not be processed due to a system problem.
de: Die Authentifikation konnte wegen eines Systemproblems nicht bearbeitet werden.

source: Invalid credentials.
de: Fehlerhafte Zugangsdaten.

source: Cookie has already been used by someone else.
de: Cookie wurde bereits von jemand anderem verwendet.

source: Not privileged to request the resource.
de: Keine Rechte, um die Ressource anzufragen.

source: Invalid CSRF token.
de: Ungültiges CSRF-Token.

source: No authentication provider found to support the authentication token.
de: Es wurde kein Authentifizierungs-Provider gefunden, der das Authentifizierungs-Token unterstützt.

source: No session available, it either timed out or cookies are not enabled.
de: Keine Session verfügbar, entweder ist diese abgelaufen oder Cookies sind nicht aktiviert.

source: No token could be found.
de: Es wurde kein Token gefunden.

source: Username could not be found.
de: Der Benutzername wurde nicht gefunden.

source: Account has expired.
de: Der Account ist abgelaufen.

source: Credentials have expired.
de: Die Zugangsdaten sind abgelaufen.

source: Account is disabled.
de: Der Account ist deaktiviert.

source: Account is locked.
de: Der Account ist gesperrt.
