Repository: Part-DB/Part-DB-server
Catalog: translations/validators.*.xlf
Languages: de

source: part.master_attachment.must_be_picture
de: Der Vorschauanhang muss ein gültiges Bild sein!

source: structural.entity.unique_name
de: Es kann auf jeder Ebene nur ein Objekt mit dem gleichem Namen geben!

source: parameters.validator.min_lesser_typical
de: Wert muss kleiner oder gleich als der typische Wert sein ({{ compared_value }}).

source: parameters.validator.min_lesser_max
de: Wert muss kleiner als der Maximalwert sein ({{ compared_value }}).

source: parameters.validator.max_greater_typical
de: Wert muss größer oder gleich dem typischen Wert sein ({{ compared_value }}).

source: validator.user.username_already_used
de: Es existiert bereits ein Benutzer mit diesem Namen.

source: user.invalid_username
de: Der Benutzername darf nur Buchstaben, Zahlen, Unterstriche, Punkte, Plus- oder Minuszeichen enthalten.

source: This value should be false.
de: Dieser Wert sollte false sein.

source: This value should be true.
de: Dieser Wert sollte true sein.

source: This value should be of type {{ type }}.
de: Dieser Wert sollte vom Typ {{ type }} sein.

source: This value should be blank.
de: Dieser Wert sollte leer sein.

source: The value you selected is not a valid choice.
de: Sie haben einen ungültigen Wert ausgewählt.

# 0d999f2
source: You must select at least {{ limit }} choice.|You must select at least {{ limit }} choices.
de: Sie müssen mindestens {{ limit }} Möglichkeit wählen.|Sie müssen mindestens {{ limit }} Möglichkeiten wählen.

source: You must select at most {{ limit }} choice.|You must select at most {{ limit }} choices.
de: Sie dürfen höchstens {{ limit }} Möglichkeit wählen.|Sie dürfen höchstens {{ limit }} Möglichkeiten wählen.

source: One or more of the given values is invalid.
de: Einer oder mehrere der angegebenen Werte sind ungültig.

source: This field was not expected.
de: Dieses Feld wurde nicht erwartet.

source: This field is missing.
de: Dieses Feld fehlt.

source: This value is not a valid date.
de: Dieser Wert entspricht keiner gültigen Datumsangabe.

source: This value is not a valid datetime.
de: Dieser Wert entspricht keiner gültigen Datums- und Zeitangabe.

source: This value is not a valid email address.
de: Dieser Wert ist keine gültige E-Mail-Adresse.

source: The file could not be found.
de: Die Datei wurde nicht gefunden.

source: The file is not readable.
de: Die Datei ist nicht lesbar.

# 1ad411a
source: The file is too large ({{ size }} {{ suffix }}). Allowed maximum size is {{ limit }} {{ suffix }}.
de: Die Datei ist zu groß ({{ size }} {{ suffix }}). Die maximal zulässige Größe beträgt {{ limit }} {{ suffix }}.

# 30a318d
source: The mime type of the file is invalid ({{ type }}). Allowed mime types are {{ types }}.
de: Der Dateityp ist ungültig ({{ type }}). Erlaubte Dateitypen sind {{ types }}.

source: This value should be {{ limit }} or less.
de: Dieser Wert sollte kleiner oder gleich {{ limit }} sein.

# 0e0c1e1
source: This value is too long. It should have {{ limit }} character or less.|This value is too long. It should have {{ limit }} characters or less.
de: Diese Zeichenkette ist zu lang. Sie sollte höchstens {{ limit }} Zeichen haben.|Diese Zeichenkette ist zu lang. Sie sollte höchstens {{ limit }} Zeichen haben.

source: This value should be {{ limit }} or more.
de: Dieser Wert sollte größer oder gleich {{ limit }} sein.

# 5188ff9
source: This value is too short. It should have {{ limit }} character or more.|This value is too short. It should have {{ limit }} characters or more.
de: Diese Zeichenkette ist zu kurz. Sie sollte mindestens {{ limit }} Zeichen haben.|Diese Zeichenkette ist zu kurz. Sie sollte mindestens {{ limit }} Zeichen haben.

source: This value should not be blank.
de: Dieser Wert sollte nicht leer sein.

source: This value should not be null.
de: Dieser Wert sollte nicht null sein.

source: This value should be null.
de: Dieser Wert sollte null sein.

source: This value is not valid.
de: Dieser Wert ist nicht gültig.

source: This value is not a valid time.
de: Dieser Wert entspricht keiner gültigen Zeitangabe.

source: This value is not a valid URL.
de: Dieser Wert ist keine gültige URL.

source: The two values should be equal.
de: Die beiden Werte sollten identisch sein.

source: The file is too large. Allowed maximum size is {{ limit }} {{ suffix }}.
de: Die Datei ist zu groß. Die maximal zulässige Größe beträgt {{ limit }} {{ suffix }}.

source: The file is too large.
de: Die Datei ist zu groß.

source: The file could not be uploaded.
de: Die Datei konnte nicht hochgeladen werden.

source: This value should be a valid number.
de: Dieser Wert sollte eine gültige Zahl sein.

source: This file is not a valid image.
de: Diese Datei ist kein gültiges Bild.

source: This is not a valid IP address.
de: Dies ist keine gültige IP-Adresse.

source: This value is not a valid language.
de: Dieser Wert entspricht keiner gültigen Sprache.

source: This value is not a valid locale.
de: Dieser Wert entspricht keinem gültigen Gebietsschema.

source: This value is not a valid country.
de: Dieser Wert entspricht keinem gültigen Land.

source: This value is already used.
de: Dieser Wert wird bereits verwendet.

source: The size of the image could not be detected.
de: Die Größe des Bildes konnte nicht ermittelt werden.

# 266051e
source: The image width is too big ({{ width }}px). Allowed maximum width is {{ max_width }}px.
de: Die Bildbreite ist zu groß ({{ width }}px). Die maximal zulässige Breite beträgt {{ max_width }}px.

# c1c23f9
source: The image width is too small ({{ width }}px). Minimum width expected is {{ min_width }}px.
de: Die Bildbreite ist zu gering ({{ width }}px). Die erwartete Mindestbreite beträgt {{ min_width }}px.

# 9a128f7
source: The image height is too big ({{ height }}px). Allowed maximum height is {{ max_height }}px.
de: Die Bildhöhe ist zu groß ({{ height }}px). Die maximal zulässige Höhe beträgt {{ max_height }}px.

# 8a4cd70
source: The image height is too small ({{ height }}px). Minimum height expected is {{ min_height }}px.
de: Die Bildhöhe ist zu gering ({{ height }}px). Die erwartete Mindesthöhe beträgt {{ min_height }}px.

source: This value should be the user's current password.
de: Dieser Wert sollte dem aktuellen Benutzerpasswort entsprechen.

# fd389d6
source: This value should have exactly {{ limit }} character.|This value should have exactly {{ limit }} characters.
de: Dieser Wert sollte genau {{ limit }} Zeichen lang sein.|Dieser Wert sollte genau {{ limit }} Zeichen lang sein.

source: The file was only partially uploaded.
de: Die Datei wurde nur teilweise hochgeladen.

source: No file was uploaded.
de: Es wurde keine Datei hochgeladen.

source: No temporary folder was configured in php.ini.
de: Es wurde kein temporärer Ordner in der php.ini konfiguriert oder der temporäre Ordner existiert nicht.

source: Cannot write temporary file to disk.
de: Kann die temporäre Datei nicht speichern.

source: A PHP extension caused the upload to fail.
de: Eine PHP-Erweiterung verhinderte den Upload.

# b54c218
source: This collection should contain {{ limit }} element or more.|This collection should contain {{ limit }} elements or more.
de: Diese Sammlung sollte {{ limit }} oder mehr Elemente beinhalten.|Diese Sammlung sollte {{ limit }} oder mehr Elemente beinhalten.

# 949632c
source: This collection should contain {{ limit }} element or less.|This collection should contain {{ limit }} elements or less.
de: Diese Sammlung sollte {{ limit }} oder weniger Elemente beinhalten.|Diese Sammlung sollte {{ limit }} oder weniger Elemente beinhalten.

# e0582dc
source: This collection should contain exactly {{ limit }} element.|This collection should contain exactly {{ limit }} elements.
de: Diese Sammlung sollte genau {{ limit }} Element beinhalten.|Diese Sammlung sollte genau {{ limit }} Elemente beinhalten.

source: Invalid card number.
de: Ungültige Kartennummer.

source: Unsupported card type or invalid card number.
de: Nicht unterstützer Kartentyp oder ungültige Kartennummer.

source: This is not a valid International Bank Account Number (IBAN).
de: Dieser Wert ist keine gültige internationale Bankkontonummer (IBAN).

source: This value is not a valid ISBN-10.
de: Dieser Wert entspricht keiner gültigen ISBN-10.

source: This value is not a valid ISBN-13.
de: Dieser Wert entspricht keiner gültigen ISBN-13.

source: This value is neither a valid ISBN-10 nor a valid ISBN-13.
de: Dieser Wert ist weder eine gültige ISBN-10 noch eine gültige ISBN-13.

source: This value is not a valid ISSN.
de: Dieser Wert ist keine gültige ISSN.

source: This value is not a valid currency.
de: Dieser Wert ist keine gültige Währung.

source: This value should be equal to {{ compared_value }}.
de: Dieser Wert sollte gleich {{ compared_value }} sein.

source: This value should be greater than {{ compared_value }}.
de: Dieser Wert sollte größer als {{ compared_value }} sein.

source: This value should be greater than or equal to {{ compared_value }}.
de: Dieser Wert sollte größer oder gleich {{ compared_value }} sein.

source: This value should be identical to {{ compared_value_type }} {{ compared_value }}.
de: Dieser Wert sollte identisch sein mit {{ compared_value_type }} {{ compared_value }}.

source: This value should be less than {{ compared_value }}.
de: Dieser Wert sollte kleiner als {{ compared_value }} sein.

source: This value should be less than or equal to {{ compared_value }}.
de: Dieser Wert sollte kleiner oder gleich {{ compared_value }} sein.

source: This value should not be equal to {{ compared_value }}.
de: Dieser Wert sollte nicht {{ compared_value }} sein.

# 0eedf91
source: This value should not be identical to {{ compared_value_type }} {{ compared_value }}.
de: Dieser Wert sollte nicht identisch sein mit {{ compared_value_type }} {{ compared_value }}.

# 9c3ad0f
source: The image ratio is too big ({{ ratio }}). Allowed maximum ratio is {{ max_ratio }}.
de: Das Seitenverhältnis des Bildes ist zu groß ({{ ratio }}). Der erlaubte Maximalwert ist {{ max_ratio }}.

# 4376d45
source: The image ratio is too small ({{ ratio }}). Minimum ratio expected is {{ min_ratio }}.
de: Das Seitenverhältnis des Bildes ist zu klein ({{ ratio }}). Der erwartete Minimalwert ist {{ min_ratio }}.

source: The image is square ({{ width }}x{{ height }}px). Square images are not allowed.
de: Das Bild ist quadratisch ({{ width }}x{{ height }}px). Quadratische Bilder sind nicht erlaubt.

# 1dc128a
source: The image is landscape oriented ({{ width }}x{{ height }}px). Landscape oriented images are not allowed.
de: Das Bild ist im Querformat ({{ width }}x{{ height }}px). Bilder im Querformat sind nicht erlaubt.

# 9e27714
source: The image is portrait oriented ({{ width }}x{{ height }}px). Portrait oriented images are not allowed.
de: Das Bild ist im Hochformat ({{ width }}x{{ height }}px). Bilder im Hochformat sind nicht erlaubt.

source: An empty file is not allowed.
de: Eine leere Datei ist nicht erlaubt.

source: The host could not be resolved.
de: Der Hostname konnte nicht aufgelöst werden.

source: This value does not match the expected {{ charset }} charset.
de: Dieser Wert entspricht nicht dem erwarteten Zeichensatz {{ charset }}.

source: This is not a valid Business Identifier Code (BIC).
de: Dieser Wert ist kein gültiger BIC.

source: Error
de: Fehler

source: This is not a valid UUID.
de: Dies ist keine gültige UUID.

source: This value should be a multiple of {{ compared_value }}.
de: Dieser Wert sollte ein Vielfaches von {{ compared_value }} sein.

source: This Business Identifier Code (BIC) is not associated with IBAN {{ iban }}.
de: Diese internationale Bankleitzahl (BIC) ist nicht mit der IBAN {{ iban }} assoziiert.

source: This value should be valid JSON.
de: Dieser Wert sollte gültiges JSON sein.

source: This collection should contain only unique elements.
de: Diese Sammlung darf keine doppelten Elemente enthalten.

source: This value should be positive.
de: Diese Zahl sollte positiv sein.

source: This value should be either positive or zero.
de: Diese Zahl sollte entweder positiv oder 0 sein.

source: This value should be negative.
de: Diese Zahl sollte negativ sein.

source: This value should be either negative or zero.
de: Diese Zahl sollte entweder negativ oder 0 sein.

source: This value is not a valid timezone.
de: Dieser Wert ist keine gültige Zeitzone.

# 7e27e92
source: This password has been leaked in a data breach, it must not be used. Please use another password.
de: Dieses Passwort ist Teil eines Datenlecks, es darf nicht verwendet werden.

source: This value should be between {{ min }} and {{ max }}.
de: Dieser Wert sollte zwischen {{ min }} und {{ max }} sein.

source: This value is not a valid hostname.
de: Dieser Wert ist kein gültiger Hostname.

# d165c02
source: The number of elements in this collection should be a multiple of {{ compared_value }}.
de: Die Anzahl an Elementen in dieser Sammlung sollte ein Vielfaches von {{ compared_value }} sein.

source: This form should not contain extra fields.
de: Dieses Formular sollte keine zusätzlichen Felder enthalten.

source: The uploaded file was too large. Please try to upload a smaller file.
de: Die hochgeladene Datei ist zu groß. Versuchen Sie bitte eine kleinere Datei hochzuladen.

source: The CSRF token is invalid. Please try to resubmit the form.
de: Der CSRF-Token ist ungültig. Versuchen Sie bitte das Formular erneut zu senden.

source: validator.noneofitschild.self
de: Ein Element kann nicht sich selbst übergeordnet sein!

source: validator.noneofitschild.children
de: Ein Kindelement kann nicht das übergeordnete Element sein!

source: validator.isSelectable
de: Das Element muss auswählbar sein!

source: validator.part_lot.location_full.no_increasment
de: Der verwendete Lagerort wurde als voll markiert, daher kann der Bestand nicht erhöht werden. (Neuer Bestand maximal {{ old_amount }})

source: validator.part_lot.location_full
de: Der Lagerort ist voll, daher können keine neue Teile hinzugefügt werden.

source: validator.part_lot.only_existing
de: Der Lagerort wurde als "nur bestehende Teile" markiert, daher können keine neuen Teile hinzugefügt werden.

source: validator.part_lot.single_part
de: Der Lagerort wurde als "Nur ein Bauteil" markiert, daher kann kein neues Bauteil hinzugefügt werden.
